# Description: Brewfile for Homebrew Bundle

# Taps
tap "anomalyco/tap"
tap "hashicorp/tap"
tap "hivemq/mqtt-cli"
tap "twilio/brew"

# Brews
# Data Compression and File Utilities
brew "xz"                       # General-purpose data compression with high compression ratio
brew "zlib"                     # General-purpose lossless data-compression library

# Graphics, Fonts, and Imaging
brew "libheif"                  # ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libtiff"                  # TIFF library and utilities
brew "librsvg"                  # Library to render SVG files using Cairo
brew "imagemagick"              # Tools and libraries to manipulate images in many formats

# Data and Analytics
brew "apache-arrow"             # Columnar in-memory analytics layer designed to accelerate big data
brew "gdal"                     # Geospatial Data Abstraction Library
brew "poppler"                  # PDF rendering library (based on the xpdf-3.0 code base)

# Communication, CLI and Utilities
brew "awscli"                  # Official Amazon AWS command-line interface
brew "azure-cli"               # Microsoft Azure CLI 2.0
brew "bat"                     # Cat clone with syntax highlighting and Git integration
brew "bitwarden-cli"           # Bitwarden password manager CLI
brew "commitizen"              # Tool to create committing rules for projects
brew "direnv"                  # Load/unload environment variables based on $PWD
brew "dvc"                     # Git for data science projects
brew "eza"                     # Modern, maintained replacement for ls
brew "ffmpeg"                  # Play, record, convert, and stream audio and video
brew "fx"                      # Terminal JSON viewer
brew "fzf"                     # Command-line fuzzy finder
brew "gh"                      # GitHub command-line tool
brew "git"                     # Distributed revision control system
brew "git-extras"              # Small git utilities
brew "htop"                    # Improved top (interactive process viewer)
brew "jq"                      # Lightweight and flexible command-line JSON processor
brew "just"                    # Handy way to save and run project-specific commands
brew "lazygit"                 # Simple terminal UI for git commands
brew "libmagic"                # Implementation of the file(1) command
brew "lsd"                     # Clone of ls with colorful output, file type icons, and more
brew "ollama"                  # Create, run, and share large language models (LLMs)
brew "pinentry-mac"            # Pinentry for GPG on Mac
brew "prek"                    # Pre-commit reimplemented in Rust
brew "railway"                 # Develop and deploy code with Railway
brew "ripgrep"                 # Search tool like grep and The Silver Searcher
brew "starship"                # Cross-shell prompt for astronauts
brew "swagger-codegen"         # Generate clients, server stubs, and docs from an OpenAPI spec
brew "tailscale"               # Easiest, most secure way to use WireGuard and 2FA
brew "tree"                    # Display directories as trees (with optional color/HTML output)
brew "watch"                   # Executes a program periodically, showing output fullscreen
brew "wget"                    # Internet file retriever
brew "zsh"                     # UNIX shell (command interpreter)
brew "zsh-completions"         # Additional completion definitions for zsh

# Tapped brews
brew "anomalyco/tap/opencode"          # AI coding agent in the terminal
brew "hashicorp/tap/terraform"         # Tool to build, change, and version infrastructure
brew "hivemq/mqtt-cli/mqtt-cli"        # MQTT CLI for MQTT 5.0 and MQTT 3.1.1
brew "twilio/brew/twilio"              # Twilio CLI

# Libraries, Databases, and Development Tools
brew "apache-spark"            # Engine for large-scale data processing
brew "boost"                   # Collection of portable C++ source libraries
brew "coreutils"               # GNU File, Shell, and Text utilities
brew "cryptography"            # Cryptographic recipes and primitives for Python
brew "glib"                    # Core application library for C
brew "grpc"                    # Next generation open source RPC library and framework
brew "gnupg"                   # GNU Pretty Good Privacy (PGP) package
brew "gpgme"                   # Library access to GnuPG
brew "mariadb-connector-c"     # MariaDB database connector for C applications
brew "mariadb-connector-odbc"  # Database driver using the industry standard ODBC API
brew "mongosh"                 # MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mosquitto"               # Message broker implementing the MQTT protocol
brew "mysql"                   # Open source relational database management system
brew "nghttp2"                 # HTTP/2 C Library
brew "p7zip"                   # 7-Zip (high compression file archiver) implementation
brew "pipx"                    # Executes binaries from Python packages in isolated environments
brew "qemu"                    # Generic machine emulator and virtualizer
brew "r"                       # Software environment for statistical computing
brew "ruby-build"              # Install various Ruby versions and implementations
brew "rbenv"                   # Ruby version manager
brew "redis"                   # Persistent key-value database, with built-in net interface
brew "ruby"                    # Powerful, clean, object-oriented scripting language


# Casks - Applications
cask "adobe-acrobat-reader"    # PDF reader
cask "alfred"                  # Application launcher and productivity software
cask "android-studio"          # Tools for building Android applications
cask "bbedit"                  # Text editor
cask "bitwarden"               # Desktop password and login vault
cask "cd-to"                   # Finder Toolbar app to open the current directory in the Terminal
cask "claude"                  # Claude desktop app
cask "cyberduck"               # Server and cloud storage browser
cask "db-browser-for-sqlite"   # Browser for SQLite databases
cask "dbeaver-community"       # Universal database tool and SQL client
cask "discord"                 # Voice and text chat software
cask "docker-desktop"          # App to build and share containerised applications and microservices
cask "firefox"                 # Web browser
cask "gcloud-cli"              # Google Cloud SDK CLI
cask "google-chrome"           # Web browser
cask "google-drive"            # Client for the Google Drive storage service
cask "iterm2"                  # Terminal emulator as alternative to Apple's Terminal app
cask "karabiner-elements"      # Keyboard customiser
cask "maccy"                   # Clipboard manager
cask "microsoft-teams"         # Microsoft Teams
cask "ngrok"                   # Secure tunnels to localhost
cask "openinterminal"          # Finder Toolbar app to open the current directory in Terminal or Editor
cask "postman"                 # Collaboration platform for API development
cask "responsively"            # Browser tailored for responsive web app development
cask "slack"                   # Team communication
cask "spotify"                 # Music streaming
cask "tailscale-app"           # Tailscale GUI app
cask "textmate"                # General-purpose text editor
cask "typora"                  # Configurable document editor that supports Markdown
cask "visual-studio-code"      # Open source code editor
cask "vlc"                     # Multimedia player
cask "whatsapp"                # Native desktop client for WhatsApp
cask "xquartz"                 # Open-source version of the X.Org X Window System
cask "zed"                     # Multiplayer code editor
cask "zoom"                    # Video communication and virtual meeting platform

# Casks - Fonts
# Note: setup.sh also installs every `font-*-nerd-font` cask via `brew search`.
# These are the explicit picks; the rest get pulled in by that step.
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
