tap "heroku/brew"
tap "hivemq/mqtt-cli"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "microsoft/mssql-release"
tap "mongodb/brew"


# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"

# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Development kit for the Java programming language
brew "openjdk@17"
# Engine for large-scale data processing
brew "apache-spark"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Collection of portable C++ source libraries
brew "boost"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Git for data science projects
brew "dvc"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node", link: false
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# MariaDB database connector for C applications
brew "mariadb-connector-c"
# Database driver using the industry standard ODBC API
brew "mariadb-connector-odbc"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Tool Command Language
brew "tcl-tk"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-shell prompt for astronauts
brew "starship"
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# JVM-based programming language
brew "scala"
# Cross-shell prompt for astronauts
brew "starship"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# MQTT CLI is a tool that provides a feature rich command line interface for connecting, publishing, subscribing, unsubscribing and disconnecting various MQTT clients simultaneously and supports  MQTT 5.0 and MQTT 3.1.1 
brew "hivemq/mqtt-cli/mqtt-cli"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql", link: false
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Keyboard customiser
cask "karabiner-elements"
# Application launcher and productivity software
cask "alfred"
# Text editor
cask "atom"
# Two-factor authentication software
cask "authy"
# Text, code, and markup editor
cask "bbedit"
# Desktop password and login vault
cask "bitwarden"
# Finder Toolbar app to open the current directory in the Terminal
cask "cd-to"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Online collaborative whiteboard platform
cask "miro"
cask "mqtt-explorer"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# Open-source software for live streaming and screen recording
cask "obs"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# Data science software focusing on R and Python
cask "rstudio", args: { appdir: "/Applications" }
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Text editor for code, markup and prose
cask "sublime-text"
# General-purpose text editor
cask "textmate"
# Configurable document editor that supports Markdown
cask "typora"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# web browser
cask "google-chrome"
# open source code editor
cask "visual-studio-code"
#Video communication and virtual meeting platform
cask "zoom"
#Client for the Google Drive storage service
cask "google-drive"
#Native desktop client for WhatsApp
cask "whatsapp"

#fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono-nerd-font'
cask "font-meslo-lg-nerd-font"


